Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpressionCollection.Item Property
 Gets or sets the item at a specific index.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BinaryFilterExpressionItem this[
	int Index
] { get; set; }
Public Default Property Item (
	Index As Integer
) As BinaryFilterExpressionItem
	Get
	Set
Parameters
Index
Type: System.Int32
The item index.
Return Value
Type: BinaryFilterExpressionItem
The item at the index.
Implements
IList<T>.Item[Int32]
See Also
Reference
BinaryFilterExpressionCollection Class
Tekla.Structures.Filtering Namespace